DataProcessors/РаботаСJSON.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РаботаСJSON</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РаботаСJSON/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыбратьКаталог("Выбор каталога для создания базы JSON ", Новый ОписаниеОповещения("ПослеВыбораКаталогаДляВыгрузки", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталог(ЗаголовокДиалога, Оповещение)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = ЗаголовокДиалога;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаДляВыгрузки(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Каталог = ВыбранныеФайлы[0] + "/";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОРеализацияхЗаДатуЦеликом()  
	
	МассивДляВыгрузки = Новый Массив;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаВыгрузки); 
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаВыгрузки));
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|    РеализацияТоваровИУслуг.Сотрудник.Представление КАК СотрудникПредставление,
	|    РеализацияТоваровИУслуг.ОбщаяСуммаДокументов КАК СуммаДокумента,
	|    РеализацияТоваровИУслуг.ПризнакОплаты КАК ПризнакОплаты,
	|    РеализацияТоваровИУслуг.Дата КАК Дата,
	|    РеализацияТоваровИУслуг.Номер КАК Номер
	|ИЗ
	|    Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|    РеализацияТоваровИУслуг.Проведен
	|    И РеализацияТоваровИУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|    Дата";  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл     
		
		МассивСтроки =  Новый Массив;
		
		МассивСтроки.Добавить(Выборка.СотрудникПредставление);
		МассивСтроки.Добавить(Выборка.СуммаДокумента);
		МассивСтроки.Добавить(Выборка.ПризнакОплаты);
		МассивСтроки.Добавить(Выборка.Дата);  
		МассивСтроки.Добавить(Выборка.Номер); 
		ДанныеСтроки = СтрСоединить(МассивСтроки, ";");
		
		МассивДляВыгрузки.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	возврат МассивДляВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьВJSONПоследовательно(Команда)
	
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".json";  //1
	
	Запись = Новый ЗаписьJSON; // 2
	Запись.ОткрытьФайл(ИмяФайла,,,Новый ПараметрыЗаписиJSON(, Символы.Таб)); //3
	//еще можно так
	//Запись.ОткрытьФайл(ИмяФайла); //3
	
	ДанныеРеализации = ПолучитьДанныеОРеализацияхЗаДатуЦеликом();
	
	Запись.ЗаписатьНачалоОбъекта(); //4
	
	Для ТекущаяСтрока = 0 По ДанныеРеализации.Количество() - 1 Цикл
		
		Данные = СтрРазделить(ДанныеРеализации[ТекущаяСтрока], ";");
		
		Запись.ЗаписатьИмяСвойства("Реализация"); //5
		
		Запись.ЗаписатьНачалоОбъекта(); //6
		
		Запись.ЗаписатьИмяСвойства("Номер");
		Запись.ЗаписатьЗначение(Данные[4]);
		
		Запись.ЗаписатьИмяСвойства("Сотрудник");
		Запись.ЗаписатьЗначение(Данные[0]);
		
		Запись.ЗаписатьИмяСвойства("СуммаДокумента");
		Запись.ЗаписатьЗначение(Данные[1]);
		
		Запись.ЗаписатьИмяСвойства("ПризнакОплаты");
		Запись.ЗаписатьЗначение(Данные[2]);
		
		Запись.ЗаписатьИмяСвойства("Дата");
		Запись.ЗаписатьЗначение(Данные[3]);
		
		Запись.ЗаписатьКонецОбъекта(); //7
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецОбъекта(); 
	
	Запись.Закрыть(); //8
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена!");
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьИЗJSONПоследовательно(Команда)
	
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".json";
	
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайла);
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			
			Текст = "Имя = " + Чтение.ТекущееЗначение;
			
		ИначеЕсли Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Булево
			ИЛИ Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка
			ИЛИ Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Число Тогда
			
			Текст = "Значение = " + Чтение.ТекущееЗначение;
			
		Иначе Текст = "";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Текст) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		КонецЕсли;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВJSONЦеликом(Команда)
	
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".json";
	
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл(ИмяФайла,,,Новый ПараметрыЗаписиJSON(, Символы.Таб));
	
	ДанныеРеализаций = ПолучитьДанныеОРеализацияхЗаДатуКакСтруктура();
	
	ЗаписатьJSON(Запись, ДанныеРеализаций);
	
	Запись.Закрыть();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена!");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОРеализацияхЗаДатуКакСтруктура()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаВыгрузки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаВыгрузки));
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|    РеализацияТоваровИУслуг.Сотрудник.Представление КАК СотрудникПредставление,
	|    РеализацияТоваровИУслуг.ОбщаяСуммаДокументов КАК СуммаДокумента,
	|    РеализацияТоваровИУслуг.ПризнакОплаты КАК ПризнакОплаты,
	|    РеализацияТоваровИУслуг.Дата КАК Дата,
	|    РеализацияТоваровИУслуг.Номер КАК Номер
	|ИЗ
	|    Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|    РеализацияТоваровИУслуг.Проведен
	|    И РеализацияТоваровИУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|    Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущаяСтрока = 0;
	СтруктураВыгрузки = Новый Структура();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураРеализации =  Новый Структура;
		
		СтруктураРеализации.Вставить("Номер", Выборка.Номер);
		СтруктураРеализации.Вставить("Сотрудник", Выборка.СотрудникПредставление);
		СтруктураРеализации.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		СтруктураРеализации.Вставить("ПризнакОплаты", Строка(Выборка.ПризнакОплаты));
		СтруктураРеализации.Вставить("Дата", Выборка.Дата);
		
		Если ТекущаяСтрока = 0 Тогда
			КлючСтруктурыВыгрузки = "Реализация";
		Иначе
			КлючСтруктурыВыгрузки = "Реализация" + ТекущаяСтрока;
		КонецЕсли;
		
		СтруктураВыгрузки.Вставить(КлючСтруктурыВыгрузки, СтруктураРеализации);
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
	КонецЦикла;
	
	возврат СтруктураВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьИЗJSONЦеликом(Команда)
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".json";
	
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайла);
	
	ДанныеРеализаций = ПрочитатьJSON(Чтение);
	
	Чтение.Закрыть();
	
	Для Каждого СтруктураРеализации Из ДанныеРеализаций Цикл
		Данные = СтруктураРеализации.Значение;
		ОбщегоНазначенияКлиент.СообщитьПользователю(Данные.Номер + " " + Данные.Сотрудник + " " + Данные.СуммаДокумента
		+ " " + Данные.ПризнакОплаты + " " + Данные.Дата);
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтрокуJSON(Команда)
	
	Запись = Новый ЗаписьJSON;
	
	Запись.УстановитьСтроку();
	Запись.ЗаписатьЗначение(СтрокаJSON);
	
	СтрокаJSON = Запись.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСтрокуJSON(Команда)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка Тогда
			
			Текст = Чтение.ТекущееЗначение;
			
		Иначе Текст = "";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Текст) Тогда
			СтрокаJSON = Текст;
		КонецЕсли;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
КонецПроцедуры
